app/views/comments/_list.html.haml

  &nbsp
  - Post.find(post_id.to_i).comments.each do |posting|
    .col-sm-1
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]

        %span.post-owner
          %a{:href => "/user/#{User.find(posting.commented_post.user_id).username}"}= User.find(posting.commented_post.user_id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."comment_id" IS NULL ORDER BY "posts"."created_at" DESC  [["user_id", 1]]