app/views/likes/_button.html.haml

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]
---
    %i.fa.fa-thumbs-up
    = post.likes.count