app/views/pages/_post_actions.html.haml

    %i.fa.fa-thumbs-up{style: "color: grey"}
    - if post.likes.count > 0
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]