app/views/pages/home.html.haml

  %br/
  - current_user.posts.without_comments.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."comment_id" IS NULL ORDER BY "posts"."created_at" DESC  [["user_id", 1]]