app/views/pages/index.html.haml

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
%br/
- Post.all.map do |post|