app/controllers/users_controller.rb

  def all_users
    respond_to do |format|
      format.json { render json: {response: User.all.pluck(:username)} }
---
SELECT "users"."username" FROM "users"